# if выражение1:
#     действие1
# elif выражение2:
#     действие2
# elif выражение3:
#     действие3
# else:
#     действие4

# if a < b:
#     pass # Не выполняет никаких действий 
# else:
#     print ("“Компьютер говорит Нет”")

# # определить четверть координат

# x = int(input())
# y = int(input())

# if y > 0:
#     if x > 0:
#         print("I")
#     else:
#         print('II')
# elif y < 0:
#     if x < 0:
#         print('III')
#     else:
#         print("IIII") 
# else:
#     print("Error")

'''Проверка истинности в Python'''

# Логические операторы:

# X and Y
# Истина, если оба значения X и Y истинны.

# X or Y
# Истина, если хотя бы одно из значений X или Y истинно.

# not X
# Истина, если X ложно.


# if X:
#     A = Y
# else:
#     A = Z
'''Краткая запись'''
# A = Y if X else Z