''' 
for счетчик in строка, массив, функция и т. д.:
     действие
'''
# for i in 1, 2, 3:
#     print(i)

# for i in "Привет мир!":
#     print(i)


# for i in 1, 2, 3, 'one', 'two', 'three':
#     print(i)

# for i in [1, 2, 3]:
#     print(i)

# i = 1
# for color in 'красный', 'оранжевый', 'желтый', 'зеленый', 'голубой', 'синий', 'фиолетовый':
#     print('#', i, ' цвет радуги ', color, sep = '')
#     i += 1



'''
# Функция range(начало отсчета, шаг, конец отсчета)
при одном параметре: range(конец отсчета) при этом шаг=1, начало отсчета=1
при двух параметрах: range(конец отсчета, начало отсчета=1) при этом шаг=1
'''

# for i in range(4):  # равносильно инструкции for i in 0, 1, 2, 3:
#     # здесь можно выполнять циклические действия
#     print(i)
#     print(i ** 2)
# # цикл закончился, поскольку закончился блок с отступом
# print('Конец цикла')

# sum = 0
# n = 5
# for i in range(1, n + 1):
#     sum += i
# print(sum)


