#оператор присваивания:
a = 0
#оператор множественного присваивания:
a = 0
b = 1
#еквивалентно
a, b = 0, 1

a += b # a = a + b
a -= b # a = a - b
a *= b # a = a * b
a /= b # a = a / b

#int - целое число, float - действительное число.
# a=float(input())
# b=float(input())
# print('сумма:',a+b)
# print('разность:',a-b)
# print('произведение:',a*b)
# print('частное:',a/b)
# print('целочисленное деление:',a//b)
# print('остаток от деления:',a%b)
# print('округление с точностью до 2 знаков после запятой:',round(a/b,2))
# print('квадрат числа:',a**2)
# print('степень числа:',a**b)
# print('степень числа иначе:',pow(a,b))
# print('квадратный корень из неотрицательного числа',pow(a,0.5))
# import math
# print('модуль числа:',math.fabs(-a))

print('1','2', sep=',', end='.')